type Categories = {
  [key: string]: {
    heading: string;
    description: string;
  };
};

export const categories: Categories = {
  humanNatureScore: {
    heading: "Человек-природа",
    description:
      "Шкала «Человек-Природа» отражает взаимосвязь человека и природы, а также то, насколько человек умеет работать с природой с учетом ее интересов и ограничений. Человек может использовать природу в своих целях, но он также обязан заботиться о ней и сохранять ее состояние. Профессии, связанные с шкалой «Человек-Природа», могут иметь разный уровень взаимодействия с природой. Например, ботаник может изучать растения в лаборатории, а лесник может работать напрямую с животными и растениями в лесу. В любом случае, важно, чтобы человек работал с природой с уважением и чувством ответственности.",
  },
  manTechnologyScore: {
    heading: "Человек — техника",
    description:
      "Шкала «Человек — Человек» — это тесно связанные с межличностным взаимодействием профессии. Общение с людьми, их обслуживание и прочая работа связанная людьми или коллективами относится именно сюда.",
  },
  manManScore: {
    heading: "Человек — человек",
    description:
      "Шкала «Человек — Человек» — это тесно связанные с межличностным взаимодействием профессии. Общение с людьми, их обслуживание и прочая работа связанная людьми или коллективами относится именно сюда.",
  },
  manArtisticImageScore: {
    heading: "Человек- художественный образ",
    description:
      "Шкала «Человек – художественный образ» — включает в себя всё многообразие творческих специальностей. Художники, музыканты, скульпторы, архитекторы и другие подобные профессии получают большинство баллов по этой шкале.",
  },
  manSignScore: {
    heading: "Человек — знаковая система",
    description:
      "Шкала «Человек – знак» — это огромный мир профессий, связанных с обработкой разных видов информации (буквенной, цифровой и т.д.). Музыкальные профессии тоже относятся сюда.",
  },
};
