interface ProfessionCategoriesTypes {
  [key: string]: {
    headding: string;
    describe: string;
  };
}

export const ProfessionCategoriesInfo: ProfessionCategoriesTypes = {
  nature: {
    headding: "Человек-Природа",
    describe:
      "Шкала «Человек-Природа» отражает взаимосвязь человека и природы, а также то, насколько человек умеет работать с природой с учетом ее интересов и ограничений. Человек может использовать природу в своих целях, но он также обязан заботиться о ней и сохранять ее состояние.",
  },
  man: {
    headding: "Человек — человек",
    describe:
      "Профессии, связанные с шкалой «Человек-Человек», часто требуют умения работать с людьми и уметь эффективно общаться с ними. Это может быть работа в сфере услуг, образования, социальной работы или в качестве консультанта. Такие профессии также могут требовать умения слушать и разрешать конфликты, уметь работать в команде и эффективно организовывать работу. Важно уметь адаптироваться к различным личностям и ситуациям, чтобы максимально эффективно работать с людьми. Это также может включать в себя умение работать в команде и адаптироваться к различным ситуациям и личностям. Для эффективной работы с людьми такжe важно уметь эффективно организовывать свою работу и иметь хорошую последовательность мышления, чтобы решать проблемы и достигать своих целей. Также важно уметь эффективно управлять своим временем и ресурсами, чтобы достичь максимальной эффективности в работе с людьми.",
  },
  technology: {
    headding: "Человек — техника",
    describe:
      "Категория «Человек-техника» охватывает такие области, как информационные технологии, автоматизация производства, робототехника и многие другие. Она изучает способы создания и использования техники, разрабатываемой с учетом физических, психологических и социальных особенностей человека. В этой области разрабатываются и улучшаются такие технологии, как интерфейсы человек-машина, рабочие станции, инструменты и оборудование, а также разрабатываются специальные программное обеспечение и технологии для управления роботами и другими автоматизированными системами.",
  },
  artistic: {
    headding: "Человек- художественный образ",
    describe:
      "Профессии, связанные с шкалой «Человек-Художественный образ», требуют творческого мышления, художественных навыков и способности визуально воспринимать мир. Эти профессии также требуют умения экспериментировать, исследовать и изучать различные художественные техники и стили, чтобы развивать свою творческую способность. В таких профессиях также важно уметь общаться с другими художниками и с целевой аудиторией, чтобы понимать их потребности и вкусы, а также уметь продвигать свои творения.",
  },
  sign: {
    headding: "Человек — знаковая система",
    describe:
      "Профессии, связанные с шкалой «Человек-Знак», требуют умения работать с различными видами информации, в том числе цифрами, буквами, знаками и символами. Эти профессии часто связаны с обработкой информации, анализом данных, программированием или музыкальной индустрией. Такие профессии требуют умения работать с различными инструментами и технологиями, например, компьютерами, программами или музыкальными инструментами, чтобы обрабатывать информацию и создавать что-то новое.",
  },
};
