/* eslint-disable */

// Charset declaration

charset = "utf-8"

module.exports = {
  up: async (queryInterface, Sequelize) => {
    await queryInterface.bulkInsert("professions", [
      {
        categories_id: 1,
        profession_name: "Работник сферы услуг",
        learningIn: ["Белорусский государственный университет"],
      },
      {
        categories_id: 1,
        profession_name: "Педагог",
        learningIn: [
          "Белорусский государственный университет",
          "Белорусский государственный университет культуры и искусств",
        ],
      },
      {
        categories_id: 1,
        profession_name: "Социальный работник",
        learningIn: ["Белорусский государственный университет"],
      },
      {
        categories_id: 1,
        profession_name: "Консультант",
        learningIn: [
          "Белорусский государственный университет",
          "Белорусский государственный университет культуры и искусств",
        ],
      },
      {
        profession_name: "Информационные технологии",
        learningIn: ["БГУ", "БГТУ", "БНТУ", "БГАУ"],
        categories_id: 2,
      },
      {
        profession_name: "Автоматизация производства",
        learningIn: ["БГУ", "БГТУ", "БНТУ", "БГАУ"],
        categories_id: 2,
      },
      {
        profession_name: "Робототехника",
        learningIn: ["БГУ", "БГТУ", "БНТУ", "БГАУ"],
        categories_id: 2,
      },
      {
        profession_name: "Ботаник",
        categories_id: 3,
        learningIn: [
          "Белорусский государственный университет",
          "Белорусский государственный университет информатики и радиоэлектроники",
          "Белорусский государственный университет транспорта",
        ],
      },
      {
        profession_name: "Лесник",
        categories_id: 3,
        learningIn: [
          "Белорусский государственный университет",
          "Белорусский государственный университет леса и промышленности",
          "Белорусский национальный технический университет",
        ],
      },
      {
        profession_name: "Художник",
        learningIn: [
          "Белорусский государственный университет искусств",
          "Белорусский государственный колледж искусств",
        ],
        categories_id: 4,
      },
      {
        profession_name: "Дизайнер",
        learningIn: [
          "Белорусский государственный колледж искусств",
          "Белорусский государственный университет искусств",
        ],
        categories_id: 4,
      },
      {
        profession_name: "Фотограф",
        learningIn: [
          "Белорусский государственный университет искусств",
          "Белорусский государственный колледж искусств",
        ],
        categories_id: 4,
      },
      {
        profession_name: "Программист",
        categories_id: 5,
        learningIn: [
          "Белорусский государственный университет информатики и радиоэлектроники",
          "Белорусский национальный технический университет",
        ],
      },
      {
        profession_name: "Системный администратор",
        categories_id: 5,
        learningIn: [
          "Белорусский государственный университет информатики и радиоэлектроники",
          "Белорусский национальный технический университет",
        ],
      },
      {
        profession_name: "Аналитик данных",
        categories_id: 5,
        learningIn: [
          "Белорусский государственный университет информатики и радиоэлектроники",
          "Белорусский национальный технический университет",
        ],
      },
      {
        profession_name: "Музыкальный продюсер",
        categories_id: 5,
        learningIn: [
          "Белорусский государственный консерваторий",
          "Белорусский государственный университет культуры и искусств",
        ],
      },
    ])
  },

  down: async (queryInterface, Sequelize) => {
    await queryInterface.bulkDelete("professions", null, {})
  },
}
